icc/12_argumentos.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-07-30 Wed 13:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Argumentos del main</title>
<meta name="author" content="Davidshiro Pichu" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="../inicio.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Argumentos del main</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgecb45b7">1. Paso de argumentos</a></li>
<li><a href="#org1f3f614">2. Paso de parametros</a></li>
<li><a href="#org2c440e0">3. Leyendo bien</a></li>
<li><a href="#orgcdf57f9">4. Problemas</a>
<ul>
<li><a href="#org4d9eda9">4.1. Problema 1: Años perro</a></li>
<li><a href="#orgb9d89da">4.2. Problema 2: Multiplos</a></li>
<li><a href="#orgcb45e83">4.3. Problema 3: Paradoja de cumpleaños</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Si eres un buen observador, habrás notado que el parámetro del método
<code>main()</code> es un <i>arreglo de String</i> llamado <code>args</code>.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #00bfff;">static</span> <span style="color: #98f5ff;">voi</span> <span style="color: #daa520;">main</span> (<span style="color: #98f5ff;">String</span>[] <span style="color: #4eee94;">args</span>){
</pre>
</div>

<p>
Lo que significa que podemos acceder a el y pasar a nuestro programa
los parámetros que queramos <i>sin utilizar</i> <code>Scanner</code>.
</p>
<div id="outline-container-orgecb45b7" class="outline-2">
<h2 id="orgecb45b7"><span class="section-number-2">1.</span> Paso de argumentos</h2>
<div class="outline-text-2" id="text-1">
<p>
Cuando compilamos <i>y ejecutamos</i> el programa, siempre utilizamos como
</p>

<div class="org-src-container">
<pre class="src src-bash">$ java Problema1
</pre>
</div>

<p>
Pero muchos programas como <code>cowthink</code> podemos pasarle directamente la
entrada por <i>argumentos</i> como
</p>

<div class="org-src-container">
<pre class="src src-bash">$ cowthink <span style="color: #deb887;">"MMmmmmuuuu estoy pensando"</span>
</pre>
</div>

<p>
Mejor aún, podemos modificar configuraciones del programa para poder
<i>ejecutarlo de diferente manera</i>
</p>

<div class="org-src-container">
<pre class="src src-bash">$ cowthink -e xx -T U <span style="color: #deb887;">"Moricion"</span>
</pre>
</div>

<p>
El texto <code>-e xx -T U "Moricion"</code> son los <i>argumentos</i> que pasamos al
programa directamente. En <i>Java</i>, estos argumentos podemos pasarlos a
nuestro programa utilizando <code>args</code>.
</p>
</div>
</div>
<div id="outline-container-org1f3f614" class="outline-2">
<h2 id="org1f3f614"><span class="section-number-2">2.</span> Paso de parametros</h2>
<div class="outline-text-2" id="text-2">
<p>
Imprimir todos los argumentos pasados a nuestro programa en <i>Java</i>.
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #00bfff;">class</span> <span style="color: #98f5ff;">Parametros</span> {
    <span style="color: #00bfff;">public</span> <span style="color: #00bfff;">static</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">main</span>(<span style="color: #98f5ff;">String</span>[] <span style="color: #4eee94;">args</span>) {
        <span style="color: #00bfff;">for</span> (<span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">i</span> = 0; i &lt; args.<span style="color: #98f5ff;">length</span>; i++)
            System.out.println(args[i]);
    }
}
</pre>
</div>

<p>
Ejecutamos nuestro programa por ejemplo
</p>

<div class="org-src-container">
<pre class="src src-bash">$ java Parametros Lol soy varios argumentos en tu programa 
</pre>
</div>

<p>
El código es sencillo de entender, <i>Java</i> hace todo el trabajo detrás
de cámaras, y separa cada <i>palabra</i> en un <i>cajón</i> del arreglo
<code>args[]</code>; los valores <i>son <b>siempre</b> de tipo String</i>. Internamente args es como
</p>

<div class="org-src-container">
<pre class="src src-java">args = [<span style="color: #deb887;">"Lol"</span>, <span style="color: #deb887;">"soy"</span>, <span style="color: #deb887;">"varios"</span>, <span style="color: #deb887;">"argumentos"</span>, <span style="color: #deb887;">"en"</span>, <span style="color: #deb887;">"tu"</span>, <span style="color: #deb887;">"programa"</span>];
</pre>
</div>

<p>
Así, el for <i>recorre</i> el arreglo <b>hasta antes</b> de <code>args.length</code> porque
empieza en la posición 0 y los imprime.
</p>
</div>
</div>
<div id="outline-container-org2c440e0" class="outline-2">
<h2 id="org2c440e0"><span class="section-number-2">3.</span> Leyendo bien</h2>
<div class="outline-text-2" id="text-3">
<p>
Los datos guardados en <code>args[]</code> son de tipo <code>String</code>. Esto significa
que incluso si le pasamos un número como argumento, <i>Java</i> lo
detectará como una <i>String</i>. Debemos entonces convertir esa <i>String</i> a
un número.
</p>

<p>
El siguiente programa lee dos números por terminal, y muestra su
concatenacion y su suma.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #00bfff;">class</span> <span style="color: #98f5ff;">Suma</span> {
    <span style="color: #00bfff;">public</span> <span style="color: #00bfff;">static</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">main</span> (<span style="color: #98f5ff;">String</span>[] <span style="color: #4eee94;">args</span>) {
        <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Cuidado!
</span>        <span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">s1</span> = args[0];
        <span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">s2</span> = args[1];

        System.out.println(s1 + s2);

        <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">i1</span> = Integer.parseInt(s1);
        <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">i2</span> = Integer.parseInt(s2);

        System.out.println(i1 + i2);
</pre>
</div>
<p>
Debemos tener cuidado <i>si no pasamos argumentos a nuestro programa</i> ya
que estamos accediendo a los dos primeros cajones, pero podríamos
pasar ningún argumento y entonces el arreglo es de tamaño 0, no 2. Esto
genera una <code>IndexOutOfBoundException()</code> que indica que accedemos a una
posición que no existe en el arreglo.
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Cuidado!
</span><span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">s1</span> = args[0];
<span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">s2</span> = args[1];
</pre>
</div>

<p>
Como sea, pasamos dos números como argumento y los leemos en las
variables <code>s1, s2</code>.
</p>

<p>
Si las <i>sumamos</i>, estamos <i>concatenamos</i> la cadena <code>"5" + "3" = "53"</code>.
</p>
<div class="org-src-container">
<pre class="src src-java">System.out.println(s1 + s2);
</pre>
</div>

<p>
Sin embargo, utilzando el método <i>estático</i> <code>Integer.parseInt()</code>,
convertimos el <b>texto que contiene los carácteres 5 y 3</b> a los números 5
y 3. No es lo mismo "5" que 5.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">i1</span> = Integer.parseInt(s1);
<span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">i2</span> = Integer.parseInt(s2);
</pre>
</div>

<p>
Finalmente, \(5+3 = 8\) <i>ya como número</i>. Existe también el método
<code>Double.parseDouble()</code> para convertir a números decimales.
</p>
</div>
</div>
<div id="outline-container-orgcdf57f9" class="outline-2">
<h2 id="orgcdf57f9"><span class="section-number-2">4.</span> Problemas</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org4d9eda9" class="outline-3">
<h3 id="org4d9eda9"><span class="section-number-3">4.1.</span> Problema 1: Años perro</h3>
<div class="outline-text-3" id="text-4-1">
<p>
La vida de un perro pasa más rápido comparando con la vida humana. Si
bien su calendario es diferente, podemos aproximarlo utilizando la
siguiente fórmula según
<i>Pedigree</i>.
</p>

\begin{equation}
edad = \begin{cases}
  \frac{21n}{2} & \text{si } n \leq 2\\
  4n + 13 & \text{en otro caso}
\end{cases}
\end{equation}

<p>
Donde <i>n</i> es el número de años <i>humanos</i> que el perro ha vivido. Crea
un programa que pueda calcular por <i>argumentos</i> la edad de un perro.
</p>
</div>
</div>
<div id="outline-container-orgb9d89da" class="outline-3">
<h3 id="orgb9d89da"><span class="section-number-3">4.2.</span> Problema 2: Multiplos</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Crea un programa que reciba 2 números <code>n, m</code> enteros como argumentos, y nos
diga si el primer número es múltiplo del otro. Que sea múltiplo
significa que existe un número <code>k</code> tal que: 
</p>

\begin{equation}
n * k = m
\end{equation}
<p>
En otras palabras, <code>m</code> es <i>divisible</i> por <code>n</code>. Por ejemplo <code>2</code> es
múltiplo de 16, pero <code>2</code> no es múltiplo de <code>17</code>
</p>
</div>
</div>
<div id="outline-container-orgcb45e83" class="outline-3">
<h3 id="orgcb45e83"><span class="section-number-3">4.3.</span> Problema 3: Paradoja de cumpleaños</h3>
<div class="outline-text-3" id="text-4-3">
<p>
La <a href="https://www.youtube.com/watch?v=7uzx6D_0V7M">paradoja del cumpleaños</a> es un resultado matemático que dice que en
un grupo de 23 personas, hay más del 50% de probablilidad que 2
personas cumplan el mismo mes y día. Mira el video para entender
mejor.
</p>

<p>
La probabilidad está dada por:
</p>

\begin{equation}
P(coincidir) = 1 - \frac{(365-0) * (365-1) * (365-2) *
(365 - 3) * \ldots * (365- (n-1))}{ 365^n} 
\end{equation}

<p>
Donde 365 son los días del año y <i>n</i> el número de personas en el mismo
grupo. Crea un programa que reciba la entrada <b>n</b> <i>por argumentos</i> y
nos regrese la probabilidad de que 2 personas cumplan años el mismo
mes y día.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Davidshiro Pichu</p>
<p class="date">Created: 2025-07-30 Wed 13:32</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
